# SQLITE3

### What is Database?

- Collection of Logically Related tables are known as Database.

**IMPORTANT POINTS**

- Coulmns are known as attributes or characteristics
- Rows are also known as Tuples
- Tables: collection of Rows and columns

#### WE can interact with Database with the help of SQL (Structured Query Languages)

Two Types of **DATABASE:** 

1. Relational Data-Base: MSSQL, SQLite, MySQL, Oracle
2. Non-Relational Data-Base: MogoDB, Cassandra

            NOTE: MySQL, MSSQL is open sourse software

SQL is of 3 types:
    
1. (Data Defination Language)DDL  CREATE, ALTER,DROP
2. (Data Manulation Language)DML  SELECT,UPDATE, DELETE
3. (Data Control Language)   DCL  COMMIT/ROLLBACK,GRANT/REVOKE

## Practical:

In [1]:
# import sqlite3
import sqlite3


Steps Working with database using SQL (Structured Query Language)

1. Create connection object.
2. From connection object, create cursor object.
3. Using the Cursor object, call the execute method with create table query as the parameter.

### CREATE DATABASE

In [2]:
# student database will be created in the home page 

# db is the first connection object
db=sqlite3.connect("Student_database.db")

In [3]:
# student database will be created in the other location

# db is the first connection object
#db=sqlite3.connect("E:/Test/Student_database.db")

Cursor:

A cursor in SQL is a temporary work area created in system memory when a SQL statement is executed. A SQL cursor is a set of rows together with a pointer that identifies a current row.

It is a database object to retrieve data from a result set one row at a time.

******To work on the area we need cursor**

### CREATE CURSOR AREA

In [4]:
# create cursor object from connection:
cur=db.cursor()

**NOTE**

Now Database got created and we will procced to create table:

SQL DATA TYPES.....

- integer: Number 
- real   : decimal value
- text   : unlimited string
- char(20): only 20 characters

**CONSTRANT**

1. *Primary key---->*: Unique, Not null
2. *Unique key----->*: Unique, can be Null
3. *Not Null------->*: can be duplicated but no blank

## CREATE TABLE:

In [5]:
# create table <table_name>(id int primary key,name text,marks int)

cur.execute("create table student(id int primary key,name text,marks int)")

code is working as its showing the location of the work

## INSERT into TABLE

In [6]:
# insert into <table_name> values (1,'Alok',67)
cur.execute("insert into student values (1,'Alok',67),(2,'Anup',78),(3,'Anu',88),(4,'Anupam',89),(5,'Arnav',93),(6,'Abhijit',97)")

### Checking Row counts

In [7]:
# cur.rowcount will show the number of records inserted

print(cur.rowcount,"records inserted")

6 records inserted

In [8]:
# database name and commit will save the data
db.commit()

In [9]:
# using DML command select 
cur.execute("Select * from student").fetchall()

[(1, 'Alok', 67),
 (2, 'Anup', 78),
 (3, 'Anu', 88),
 (4, 'Anupam', 89),
 (5, 'Arnav', 93),
 (6, 'Abhijit', 97)]

In [10]:
# Again DML command is used to check all the content and the word is "SELECT" 
result=cur.execute("select * from student")

for row in result:
    print(row)

(1, 'Alok', 67)
(2, 'Anup', 78)
(3, 'Anu', 88)
(4, 'Anupam', 89)
(5, 'Arnav', 93)
(6, 'Abhijit', 97)

In [11]:
# Adding more data onto table by using DML command insert
cur.execute("insert into student values (7,'Ankit',67),(8,'Ankur',87),(9,'Abhishek',69),(10,'Aniket',59)")

# saving the data to database.
db.commit()

In [12]:
# checking total rows into student table
print(cur.rowcount,"Records inserted")

4 Records inserted

In [13]:
for i in cur.execute("Select * from student"):
    print(i)

(1, 'Alok', 67)
(2, 'Anup', 78)
(3, 'Anu', 88)
(4, 'Anupam', 89)
(5, 'Arnav', 93)
(6, 'Abhijit', 97)
(7, 'Ankit', 67)
(8, 'Ankur', 87)
(9, 'Abhishek', 69)
(10, 'Aniket', 59)

In [14]:
# adding more values using DML command insert

# syntax: insert into <table name> values (),().....so on
cur.execute("Insert into student values (11,'Bikram',82),(12,'Bittu',95),(13,'Bikki',85),(14,'Bhavesh',79),(15,'Binod',82)")
# will save the data into database
db.commit()

In [15]:
# checking rows inserted into into table
print(cur.rowcount,"Rows Inserted")

5 Rows Inserted

In [16]:
# checking data using DML tool "SELECT"
cur.execute("Select * from student").fetchall()

[(1, 'Alok', 67),
 (2, 'Anup', 78),
 (3, 'Anu', 88),
 (4, 'Anupam', 89),
 (5, 'Arnav', 93),
 (6, 'Abhijit', 97),
 (7, 'Ankit', 67),
 (8, 'Ankur', 87),
 (9, 'Abhishek', 69),
 (10, 'Aniket', 59),
 (11, 'Bikram', 82),
 (12, 'Bittu', 95),
 (13, 'Bikki', 85),
 (14, 'Bhavesh', 79),
 (15, 'Binod', 82)]

## SELECT

In [18]:
# will fetch only name
# syntax: select <column name>,<column name> from <table name>

cur.execute("Select name from student").fetchall()

[('Alok',),
 ('Anup',),
 ('Anu',),
 ('Anupam',),
 ('Arnav',),
 ('Abhijit',),
 ('Ankit',),
 ('Ankur',),
 ('Abhishek',),
 ('Aniket',),
 ('Bikram',),
 ('Bittu',),
 ('Bikki',),
 ('Bhavesh',),
 ('Binod',)]

In [19]:
# syntax: select <cl name>,<cl name> from <table name>
cur.execute("Select id,name from student").fetchall()

[(1, 'Alok'),
 (2, 'Anup'),
 (3, 'Anu'),
 (4, 'Anupam'),
 (5, 'Arnav'),
 (6, 'Abhijit'),
 (7, 'Ankit'),
 (8, 'Ankur'),
 (9, 'Abhishek'),
 (10, 'Aniket'),
 (11, 'Bikram'),
 (12, 'Bittu'),
 (13, 'Bikki'),
 (14, 'Bhavesh'),
 (15, 'Binod')]

In [20]:
# syntax: slect <cl name>,<cl name> from <table name>
cur.execute("select id,name,marks from student").fetchall()

[(1, 'Alok', 67),
 (2, 'Anup', 78),
 (3, 'Anu', 88),
 (4, 'Anupam', 89),
 (5, 'Arnav', 93),
 (6, 'Abhijit', 97),
 (7, 'Ankit', 67),
 (8, 'Ankur', 87),
 (9, 'Abhishek', 69),
 (10, 'Aniket', 59),
 (11, 'Bikram', 82),
 (12, 'Bittu', 95),
 (13, 'Bikki', 85),
 (14, 'Bhavesh', 79),
 (15, 'Binod', 82)]

In [21]:
# creating the new table in student_database
cur.execute("create table Marks(id int primary key,name varchar(30) not null,subject varchar(20))")

In [23]:
# Using DML insert command entering the values
cur.execute("insert into Marks values (1,'Avinash','English'),(2,'Avinav','Maths'),(3,'Anuvab','Science'),(4,'Puneet','Computer Science')")
db.commit()

In [24]:
# checking rows inserted
print(cur.rowcount,"Rows inserted")

4 Rows inserted

In [25]:
# fetching all the data from Marks table
cur.execute("Select * from Marks").fetchall()

[(1, 'Avinash', 'English'),
 (2, 'Avinav', 'Maths'),
 (3, 'Anuvab', 'Science'),
 (4, 'Puneet', 'Computer Science')]

*************

Day 2...............

In [1]:
# importing package sqlite3
import sqlite3

# connecting with database with connection object
db=sqlite3.connect("Student_database.db") # today it will just connect as its already created yesterday...

# making the cursor area.
cur=db.cursor()

In [3]:
cur.execute("Select * from student").fetchall()

[(1, 'Alok', 67),
 (2, 'Anup', 78),
 (3, 'Anu', 88),
 (4, 'Anupam', 89),
 (5, 'Arnav', 93),
 (6, 'Abhijit', 97),
 (7, 'Ankit', 67),
 (8, 'Ankur', 87),
 (9, 'Abhishek', 69),
 (10, 'Aniket', 59),
 (11, 'Bikram', 82),
 (12, 'Bittu', 95),
 (13, 'Bikki', 85),
 (14, 'Bhavesh', 79),
 (15, 'Binod', 82)]

In [11]:
print(cur.execute("select name,marks from student").fetchall(),"\n")
print(cur.execute("select subject,name from marks").fetchall())

[('Alok', 67), ('Anup', 78), ('Anu', 88), ('Anupam', 89), ('Arnav', 93), ('Abhijit', 97), ('Ankit', 67), ('Ankur', 87), ('Abhishek', 69), ('Aniket', 59), ('Bikram', 82), ('Bittu', 95), ('Bikki', 85), ('Bhavesh', 79), ('Binod', 82)]

[('English', 'Avinash'), ('Maths', 'Avinav'), ('Science', 'Anuvab'), ('Computer Science', 'Puneet')]

### Where Clause

In [14]:
# show table student where id is less than 2

result=cur.execute("select name,id from student where id<2")
result.fetchall()

[('Alok', 1)]

In [16]:
# show table student where id is greater than 7

# SYNTEX: SELECT * FROM STUDENT WHERE ID>7
cur.execute("Select * from student where id>7").fetchall()

[(8, 'Ankur', 87),
 (9, 'Abhishek', 69),
 (10, 'Aniket', 59),
 (11, 'Bikram', 82),
 (12, 'Bittu', 95),
 (13, 'Bikki', 85),
 (14, 'Bhavesh', 79),
 (15, 'Binod', 82)]

In [17]:
# show name from table student where marks less than 70

print(cur.execute("Select name from student where marks<70").fetchall())

[('Alok',), ('Ankit',), ('Abhishek',), ('Aniket',)]

## LIMIT Clause/Operator

- select * from student limit 5

In [18]:
# checking top 3 names, marks from student table 

cur.execute("Select name,marks from student limit 3").fetchall()

[('Alok', 67), ('Anup', 78), ('Anu', 88)]

#### Checking Top 5

In [21]:
# checking top 5 from student

print("Top 5\n",cur.execute("Select * from student limit 5").fetchall())

      Top 5
 [(1, 'Alok', 67), (2, 'Anup', 78), (3, 'Anu', 88), (4, 'Anupam', 89), (5, 'Arnav', 93)]

### Checking particular data(ROW) from table

In [25]:
print(cur.execute("select name,subject from marks where id==3").fetchall())
print(cur.execute("Select name,marks from student where id==2").fetchall())
print(cur.execute("Select name, id, marks from student where id==1").fetchone())
print(cur.execute("Select name,marks from student where name=='Abhijit'").fetchone())

[('Anuvab', 'Science')]
[('Anup', 78)]
('Alok', 1, 67)
('Abhijit', 97)

## Checking by NAME

In [27]:
# checking the values where name is Ankit
print(cur.execute("Select * from student where name=='Ankit'").fetchall())

[(7, 'Ankit', 67)]

In [28]:
# check name from marks where subject=="science"
print(cur.execute("Select name from marks where subject=='Science'").fetchall())

[('Anuvab',)]

### And Operation:

You will get the responce when both the values are True

In [30]:
# show marks greater than 60 and less than 80
print(cur.execute("Select * from student where marks>60 and marks<80").fetchall())

[(1, 'Alok', 67), (2, 'Anup', 78), (7, 'Ankit', 67), (9, 'Abhishek', 69), (14, 'Bhavesh', 79)]

In [37]:
print(cur.execute("Select * from student where id==1 and name='Alok'").fetchall())

[(1, 'Alok', 67)]

In [38]:
print(cur.execute("Select * from marks where subject=='Science'").fetchall())

[(3, 'Anuvab', 'Science')]

In [40]:
print(cur.execute("select * from marks where subject=='Computer Science'").fetchall())

[(4, 'Puneet', 'Computer Science')]

## Or Operation:
    
- NOTE: - Either one is true you will get the result.

- SYNTAX: select name id from < table name> where <id==2> or <name='Ankit'>

In [41]:
print(cur.execute("Select * from student where id==1 or name=='Abhijit'").fetchall())

[(1, 'Alok', 67), (6, 'Abhijit', 97)]

In [43]:
print(cur.execute("select * from student where id==1 or name='Bhavesh'").fetchall())

[(1, 'Alok', 67), (14, 'Bhavesh', 79)]

In [45]:
print(cur.execute("select name,id,subject from marks where id==3 or subject=='Computer Science'").fetchall())

[('Anuvab', 3, 'Science'), ('Puneet', 4, 'Computer Science')]

## ORDER BY Clause

- Order by name desc
- Order by name asc

In [47]:
# Syntax: select name, id, marks from <table_name> where <marks>80> order by marks desc
print(cur.execute("Select name,id,marks from student where marks>80 order by marks desc").fetchall())

[('Abhijit', 6, 97), ('Bittu', 12, 95), ('Arnav', 5, 93), ('Anupam', 4, 89), ('Anu', 3, 88), ('Ankur', 8, 87), ('Bikki', 13, 85), ('Bikram', 11, 82), ('Binod', 15, 82)]

In [49]:
# Syntax:

print(cur.execute("Select * from marks where id>=1 order by name desc").fetchall())

[(4, 'Puneet', 'Computer Science'), (2, 'Avinav', 'Maths'), (1, 'Avinash', 'English'), (3, 'Anuvab', 'Science')]

In [50]:
print(cur.execute("select * from marks where id<10 and id>=1 order by name asc").fetchall())

[(3, 'Anuvab', 'Science'), (1, 'Avinash', 'English'), (2, 'Avinav', 'Maths'), (4, 'Puneet', 'Computer Science')]

## AGGREGATE FUNCTION

***************

1. MIN --- Find minimum 
2. MAX --- Find maximum
3. AVG --- Find average
4. SUM --- Find Sum
5. COUNT - Find count

In [51]:
# find maximum marks from student

print(cur.execute("select max(marks) from student").fetchall())

[('Abhijit', 6, 97)]

In [52]:
# show min marks from marks
print(cur.execute("select min(marks) from student").fetchall())

[(59, 10, 59)]

In [54]:
# show average marks 

print(cur.execute("Select round(avg(marks),2) from student").fetchall())

[('Alok', 1, 81.13)]

In [58]:
# it would count and let us know total number of ids

print(cur.execute("Select count(id) from student ").fetchall())

[(15,)]

In [61]:
# it would sum all the id's
print(cur.execute("Select sum(id) from student").fetchone())

(120,)

In [63]:
# print sum of ids,count of ids,min marks,max marks,avg marks from student
print(cur.execute("select sum(id),count(id),min(marks),max(marks),round(avg(marks)) from student").fetchone())

(120, 15, 59, 97, 81.0)

In [65]:
# marks ascending order
print(cur.execute("Select * from student order by marks asc").fetchall())

[(10, 'Aniket', 59), (1, 'Alok', 67), (7, 'Ankit', 67), (9, 'Abhishek', 69), (2, 'Anup', 78), (14, 'Bhavesh', 79), (11, 'Bikram', 82), (15, 'Binod', 82), (13, 'Bikki', 85), (8, 'Ankur', 87), (3, 'Anu', 88), (4, 'Anupam', 89), (5, 'Arnav', 93), (12, 'Bittu', 95), (6, 'Abhijit', 97)]

In [67]:
# marks descending order
print(cur.execute("select * from student order by name desc").fetchall())

[(12, 'Bittu', 95), (15, 'Binod', 82), (11, 'Bikram', 82), (13, 'Bikki', 85), (14, 'Bhavesh', 79), (5, 'Arnav', 93), (4, 'Anupam', 89), (2, 'Anup', 78), (3, 'Anu', 88), (8, 'Ankur', 87), (7, 'Ankit', 67), (10, 'Aniket', 59), (1, 'Alok', 67), (9, 'Abhishek', 69), (6, 'Abhijit', 97)]

## BETWEEN Operator

In [70]:
# between operator...

print(cur.execute("select * from student where marks between 60 and 90").fetchall())

[(1, 'Alok', 67), (2, 'Anup', 78), (3, 'Anu', 88), (4, 'Anupam', 89), (7, 'Ankit', 67), (8, 'Ankur', 87), (9, 'Abhishek', 69), (11, 'Bikram', 82), (13, 'Bikki', 85), (14, 'Bhavesh', 79), (15, 'Binod', 82)]

In [37]:
# Between Operator.

print(cur.execute("Select name, id from student where marks between 50 and 60").fetchall())
print(cur.execute("select * from marks where id between 6 and 8").fetchall())
print(cur.execute("select name, id from marks where id between 2 and 6").fetchall())

[('Aniket', 10)]
[(6, 'Bhavesh', 'Computer Science'), (7, 'Bhushan', 'Maths'), (8, 'Varun', 'English')]
[('Avinav', 2), ('Anuvab', 3), ('Puneet', 4), ('Bikash', 5), ('Bhavesh', 6)]

In [43]:
# between operator....

print(cur.execute("Select name from marks where id between 7 and 8").fetchall())

[('Bhushan',), ('Varun',)]

## NULL

In [48]:
# all are full they are not responsing
result=cur.execute("select * from student where marks is null")
result.fetchall()

[]

In [50]:
# show where the value is not null

result=cur.execute("Select * from student where marks is not null")
print( result.fetchall())

[(1, 'Alok', 67), (2, 'Anup', 78), (3, 'Anu', 88), (4, 'Anupam', 89), (5, 'Arnav', 93), (6, 'Abhijit', 97), (7, 'Ankit', 67), (8, 'Ankur', 87), (9, 'Abhishek', 69), (10, 'Aniket', 59), (11, 'Bikram', 82), (12, 'Bittu', 95), (13, 'Bikki', 85), (14, 'Bhavesh', 79), (15, 'Binod', 82)]

## LIKE operator

In [51]:
# show name start from Ab......
result=cur.execute("select * from student where name like 'Ab%'")
result.fetchone()

(6, 'Abhijit', 97)

In [52]:
# show 
result=cur.execute("select * from student where marks like '8%'")
result.fetchone()

(3, 'Anu', 88)

In [54]:
result=cur.execute("Select * from student where marks like '%8'")
result.fetchall()

[(2, 'Anup', 78), (3, 'Anu', 88)]

In [56]:
# show 
result=cur.execute("Select * from marks where name like 'A%'")
result.fetchall()

[(1, 'Avinash', 'English'), (2, 'Avinav', 'Maths'), (3, 'Anuvab', 'Science')]

In [57]:
# show subject start with capital S and rest anything......

result=cur.execute("select * from marks where subject like 'S%'")
result.fetchall()

[(3, 'Anuvab', 'Science'), (5, 'Bikash', 'Science')]

In [61]:
# show name start from anything middle is i than anything

print(cur.execute("select name,id from student where name like '%i%'").fetchall())

[('Abhijit', 6), ('Ankit', 7), ('Abhishek', 9), ('Aniket', 10), ('Bikram', 11), ('Bittu', 12), ('Bikki', 13), ('Binod', 15)]

In [62]:
# show name starts with any single alphabet and then b then anything............

print(cur.execute("select name from student where name like '_b%' ").fetchall())

[('Abhijit',), ('Abhishek',)]

In [63]:
# find name with '_ _ _ _jit'
print(cur.execute("select name from student where name like '____jit'").fetchall())

[('Abhijit',)]

## NOT in Operator

In [70]:
# NOT in (70)

print(cur.execute("Select * from marks where Subject NOT IN ('Science')").fetchall())

# note: ALWAYS USE BRACKET FOR ELSE NO RESULT

[(1, 'Avinash', 'English'), (2, 'Avinav', 'Maths'), (4, 'Puneet', 'Computer Science'), (6, 'Bhavesh', 'Computer Science'), (7, 'Bhushan', 'Maths'), (8, 'Varun', 'English')]

In [90]:
print(cur.execute("select name,marks from student where name NOT in (Select name from student where name like 'A%')").fetchall())

[('Bikram', 82), ('Bittu', 95), ('Bikki', 85), ('Bhavesh', 79), ('Binod', 82)]

In [92]:
print(cur.execute("select marks,name from student where marks not in (select marks from student where marks between 70 and 100)").fetchall())

[(67, 'Alok'), (67, 'Ankit'), (69, 'Abhishek'), (59, 'Aniket')]

## Update Record

- SYNTEX: update student set <<MARKS=81>> where <<id==2>>

In [93]:

sql="update student set marks=81 where name='Alok' "
cur.execute(sql)
db.commit()

In [95]:
cur.execute("Select name,id,marks from student where name='Alok'").fetchone()

('Alok', 1, 81)

In [6]:
print(cur.execute("select name,id,marks from student where id not in (select id from student where marks<80)").fetchall())

[('Alok', 1, 81), ('Anu', 3, 88), ('Anupam', 4, 89), ('Arnav', 5, 93), ('Abhijit', 6, 97), ('Ankur', 8, 87), ('Bikram', 11, 82), ('Bittu', 12, 95), ('Bikki', 13, 85), ('Binod', 15, 82)]

## IN Operator:


- Used to Update Multiple Records.

In [7]:
sql="update student set marks=60 where id in (1,2)"
cur.execute(sql)
db.commit()

In [10]:
for i in cur.execute("Select id, name,marks from student where marks=60"):
    print(i)

(1, 'Alok', 60)
(2, 'Anup', 60)

### Delete:

- any unwanted row

In [11]:
sql="delete from student where id==1"

cur.execute(sql)
db.commit()

In [12]:
for i in cur.execute("Select * from student limit 5"):
    print(i)

(2, 'Anup', 60)
(3, 'Anu', 88)
(4, 'Anupam', 89)
(5, 'Arnav', 93)
(6, 'Abhijit', 97)

# Drop Student Table:

In [14]:
sql='Drop table student'
cur.execute(sql)
db.commit()

# NOTE:


1. Drop Command : Used to drop table.
2. Delete Command: Used to delete or drop row

**After dropping table Type DB.close() to close the Data-Base**

In [15]:
# closing database.

db.close()


*******************
*********************
*********************

Day 3...............................(Practice)

### Practice  Question

In [1]:
# importing sqlite3
import sqlite3

# connecting object with database
db=sqlite3.connect("Student_database.db")

# making cursor
cur=db.cursor()

In [5]:
# checking the result
print(cur.execute("Select * from student").fetchall())
print("\n",cur.execute("select name,subject from marks").fetchall())

[(1, 'Alok', 67), (2, 'Anup', 78), (3, 'Anu', 88), (4, 'Anupam', 89), (5, 'Arnav', 93), (6, 'Abhijit', 97), (7, 'Ankit', 67), (8, 'Ankur', 87), (9, 'Abhishek', 69), (10, 'Aniket', 59), (11, 'Bikram', 82), (12, 'Bittu', 95), (13, 'Bikki', 85), (14, 'Bhavesh', 79), (15, 'Binod', 82)]

 [('Avinash', 'English'), ('Avinav', 'Maths'), ('Anuvab', 'Science'), ('Puneet', 'Computer Science')]

In [8]:
# INSERT FEW DATA IN MARKS TABLE
cur.execute("insert into marks VALUES (5,'Bikash','Science'),(6,'Bhavesh','Computer Science'),(7,'Bhushan','Maths'),(8,'Varun','English')")

In [9]:
# CHECKING INSERTED ROWS
print("Rows Inserted :",cur.rowcount)

Rows Inserted : 4

In [10]:
for i in cur.execute("Select * from marks"):
    print(i)

(1, 'Avinash', 'English')
(2, 'Avinav', 'Maths')
(3, 'Anuvab', 'Science')
(4, 'Puneet', 'Computer Science')
(5, 'Bikash', 'Science')
(6, 'Bhavesh', 'Computer Science')
(7, 'Bhushan', 'Maths')
(8, 'Varun', 'English')

In [11]:
# check top 5 in marks:

results=cur.execute("select * from marks limit 5")
for i in results:
    print(i)

(1, 'Avinash', 'English')
(2, 'Avinav', 'Maths')
(3, 'Anuvab', 'Science')
(4, 'Puneet', 'Computer Science')
(5, 'Bikash', 'Science')

In [12]:
# checking name, id from marks table
print(cur.execute("select name,id from marks").fetchall())

[('Avinash', 1), ('Avinav', 2), ('Anuvab', 3), ('Puneet', 4), ('Bikash', 5), ('Bhavesh', 6), ('Bhushan', 7), ('Varun', 8)]

In [13]:
# Using AND operator

# checking for name "Bikash" with id 5 in marks table
print(cur.execute("select * from marks where id=5 and name='Bikash'").fetchall())

[(5, 'Bikash', 'Science')]

In [19]:
# OR operator

# checking the details where name ='Bikash' and subject='Science'
cur.execute("Select * from marks where name='Bikash' or subject=='Science'").fetchall()

[(3, 'Anuvab', 'Science'), (5, 'Bikash', 'Science')]

In [22]:
# between clause/operator

# checking the details from id between 2 and 8
print(cur.execute("select * from marks where id  between 2 and 8").fetchall())

[(2, 'Avinav', 'Maths'), (3, 'Anuvab', 'Science'), (4, 'Puneet', 'Computer Science'), (5, 'Bikash', 'Science'), (6, 'Bhavesh', 'Computer Science'), (7, 'Bhushan', 'Maths'), (8, 'Varun', 'English')]

In [23]:
# between operator/clause

print(cur.execute("select * from marks where id between 2 and 5").fetchall())

# SYNTAX: select name from student where marks between 80 and 90 
print(cur.execute("select name from student where marks between 80 and 90").fetchall())

[(2, 'Avinav', 'Maths'), (3, 'Anuvab', 'Science'), (4, 'Puneet', 'Computer Science'), (5, 'Bikash', 'Science')]
[('Anu',), ('Anupam',), ('Ankur',), ('Bikram',), ('Bikki',), ('Binod',)]

In [25]:
# between clause/operator

print(cur.execute("Select name from Marks where id between 2 and 5").fetchall())

[('Avinav',), ('Anuvab',), ('Puneet',), ('Bikash',)]

In [26]:
# between operator/clause

result=cur.execute("select name,id from student where id between 2 and 3")
result.fetchall()

[('Anup', 2), ('Anu', 3)]

In [28]:
# aggregate function

result=cur.execute("select min(id),max(id),sum(id),count(name) from marks")
result.fetchone()

(1, 8, 36, 8)

In [29]:
# order by clause: asc,desc

print(cur.execute("select name from marks order by name desc").fetchall())

[('Varun',), ('Puneet',), ('Bikash',), ('Bhushan',), ('Bhavesh',), ('Avinav',), ('Avinash',), ('Anuvab',)]

In [31]:
# order by id desc

print(cur.execute("select name,id from marks order by id desc").fetchall())

[('Varun', 8), ('Bhushan', 7), ('Bhavesh', 6), ('Bikash', 5), ('Puneet', 4), ('Anuvab', 3), ('Avinav', 2), ('Avinash', 1)]

In [35]:
print(cur.execute("select round(avg(marks)), count(name), min(marks), max(marks) from student").fetchall())

[(81.0, 15, 59, 97)]

## Automatic Insertion of Data

In [44]:
# import library
import sqlite3

# create connection object with data base
db=sqlite3.connect("Auto_Base.db")

# create cursor object.
cur=db.cursor()

In [50]:
# create table

cur.execute("create table consumer (RowNumber int primary key, CustomerID int,surname char(30), CreditScore int, Geography varchar(30), Gender text, Age int, Tenure int, Balance int,NumofProduct int, HasCrCard int, IsActiveMember int, EstimatedSalary real, Exited int)")

In [52]:
# insert data

with open('autofile.csv','r') as file:
    total_records=0
    
    for row in file:
        cur.execute("insert into consumer values(?,?,?,?,?,?,?,?,?,?,?,?,?,?)",row.split(","))
        # will save the data to database
        db.commit()
        
        total_records+=1
        
print(total_records,"inserted")

20 inserted

In [53]:
print(cur.execute("select surname from consumer").fetchall())

[('Surname',), ('Hargrave',), ('Hill',), ('Onio',), ('Boni',), ('Mitchell',), ('Chu',), ('Bartlett',), ('Obinna',), ('He',), ('H?',), ('Bearce',), ('Andrews',), ('Kay',), ('Chin',), ('Scott',), ('Goforth',), ('Romeo',), ('Henderson',), ('Muldrow',)]

In [56]:
cur.execute("DELETE FROM consumer WHERE surname='Surname'")

In [60]:
print(cur.execute("select * from consumer limit 2").fetchall())

[(1, 15634602, 'Hargrave', 619, 'France', 'Female', 42, 2, 0, 1, 1, 1, 101348.88, 1), (2, 15647311, 'Hill', 608, 'Spain', 'Female', 41, 1, 83807.86, 1, 0, 1, 112542.58, 0)]

In [61]:
cur.execute("drop table consumer")
db.commit()
db.close()
print("Database closed Successfully....")

Database closed Successfully....

# Practice

In [18]:
# import sqlite library
import sqlite3

# create connection object
db=sqlite3.connect("Practice_database.db")

# creating cursor object from database
cur=db.cursor()

# message
print("Data Base oppend successfuly")

Data Base oppend successfuly

In [19]:
# creating table employee under Practice_database using cursor
cur.execute("create table Employee (id int Primary key, Name text, Age int, Address char(20), Salary real)")

In [20]:
cur.execute("insert into Employee values(1,'Ajeet',27,'Delhi',2000),(2,'Allen',22,'London',2500),(3,'Mark',29,'CA',20000),(4,'Kanchan',22,'Ghaziabad',2000)")
# checking number of rows inserted
print("Rows Inserted :",cur.rowcount)

Rows Inserted : 4

In [21]:
print(cur.execute("Select name from Employee where id not in (Select id from Employee where Address like 'A%')").fetchall())

[('Ajeet',), ('Allen',), ('Mark',), ('Kanchan',)]

In [23]:
print(cur.execute("Select name from Employee where id between 1 and 4").fetchall())

[('Ajeet',), ('Allen',), ('Mark',), ('Kanchan',)]

In [28]:
print(cur.execute("Select name,id from Employee where Address like '_e%'").fetchone())

('Ajeet', 1)

In [29]:
print(cur.execute("select * from Employee where salary>2000").fetchall())

[(2, 'Allen', 22, 'London', 2500.0), (3, 'Mark', 29, 'CA', 20000.0)]

In [31]:
# fetch top 5
print(cur.execute("select * from Employee limit 5").fetchall())

# order by name desc
print(cur.execute("select name from Employee Order by name desc").fetchall())

# update multiple salary 25000 where salary is 200
cur.execute('update Employee set salary=25000  (2000)')

[(1, 'Ajeet', 27, 'Delhi', 2000.0), (2, 'Allen', 22, 'London', 2500.0), (3, 'Mark', 29, 'CA', 20000.0), (4, 'Kanchan', 22, 'Ghaziabad', 2000.0)]
[('Mark',), ('Kanchan',), ('Allen',), ('Ajeet',)]

In [34]:
sql='Update Employee set salary=25000 where id in(1,4)'
cur.execute(sql)

In [37]:
cur.execute("update Employee set salary=30000 where id in (2,3)")

In [38]:
print(cur.execute("select * from Employee").fetchall())

[(1, 'Ajeet', 27, 'Delhi', 25000.0), (2, 'Allen', 22, 'London', 30000.0), (3, 'Mark', 29, 'CA', 30000.0), (4, 'Kanchan', 22, 'Ghaziabad', 25000.0)]

In [40]:
print(cur.execute("Select count(name),count(Address),min(salary),max(salary),avg(salary) from Employee").fetchone())

(4, 4, 25000.0, 30000.0, 27500.0)

In [41]:
cur.execute("drop table Employee")
db.commit()

In [42]:
db.close()

## SQL Constrant

1. Primary Key: 

  > a. Unique.   >>b. Not Null


2. Unique Key:

  > a. Unique  >>b. can be null

3. Not Null:

  > can be anything    >> but not empty

**Day 4** working with Constrant

In [1]:
# import library
import sqlite3

# create reference object
db=sqlite3.connect("Sports_database.db")

# create cursor object
cur=db.cursor()

In [2]:
# create table sports where id int primary key, sports text unique,date of event date,country text not null

sql="create table sports(id int primary key, sports text unique, dateofevent date,country text not null)"

# execute with the help of cursor
cur.execute(sql)

In [3]:
# insert data into table

sql="insert into sports values (1,'cricket','2020-06-14','India'),(2,'Tennis',2021-04-14,'Sri-Lanka'),(3,'Football',2022-06-14,'USA'),(4,'VollyBall',2022-04-05,'Europe'),(5,'BaseBall',2023-01-21,'India')"

cur.execute(sql)
db.commit()

print(cur.rowcount,"rows_inserted")

5 rows_inserted

In [4]:
# limit 
print(cur.execute("Select * from sports limit 5").fetchall())

[(1, 'cricket', '2020-06-14', 'India'), (2, 'Tennis', 2003, 'Sri-Lanka'), (3, 'Football', 2002, 'USA'), (4, 'VollyBall', 2013, 'Europe'), (5, 'BaseBall', 2001, 'India')]

In [5]:
# where clause
print(cur.execute("select id,sports from sports where country=='India'").fetchall())

[(1, 'cricket'), (5, 'BaseBall')]

In [6]:
# not in and like operator
print(cur.execute("select id,sports from sports where id not in(select id from sports where country like 'I%')").fetchall())

[(2, 'Tennis'), (3, 'Football'), (4, 'VollyBall')]

In [7]:
# between operator
print(cur.execute("select id, sports from sports where id between (2) and (5)").fetchall())

[(2, 'Tennis'), (3, 'Football'), (4, 'VollyBall'), (5, 'BaseBall')]

In [8]:
# and operator
print(cur.execute("select country,sports from sports where id<5 and id>3").fetchall())

[('Europe', 'VollyBall')]

In [9]:
# not in
print(cur.execute("Select country,sports,id from sports where id not in (2,3)").fetchall())

[('India', 'cricket', 1), ('Europe', 'VollyBall', 4), ('India', 'BaseBall', 5)]

In [10]:
# aggregate function

print(cur.execute("select count(id), sum(id), avg(id), max(id), min(id), count(country), count(sports) from sports").fetchall())

[(5, 15, 3.0, 5, 1, 5, 5)]

In [11]:
sql="drop table sports"
cur.execute(sql)
db.close()
print("Table deleted and database is closed")

Table deleted and database is closed

# Employee Database with DB and Python programmatically


**We have to use UDF(user defined function) to enter the data**

In [12]:
# import library
import sqlite3

# create reference object in seperate folder
db=sqlite3.connect('C:/Users/jitsa/OneDrive/Documents/emp_database.db') # connection created
 
# creating cursor object
cur=db.cursor()

print("Database created")

Database created

## Creating Table

In [13]:
# creating table using user defined function. 
def sql_table(con):# con=connection *NEED to enter data base name*
    cur=con.cursor()
    cur.execute("create table employee(id int primary key,name text,salary real,department text,position text,Dateofjoin date)")
    con.commit()
    return 'table created successfully'

# calling sql_table
sql_table(db)

'table created successfully'

### Manual check if its running correct

In [14]:
cur.execute("insert into employee values(1,'jack',9000,'HR','Manager','2019-07-09')")

# saving the data
db.commit()

# checking rows inserted
print(cur.rowcount,"Rows Inserted")

1 Rows Inserted

## Insert Values into Employee Table

In [15]:
# insert data into database

def sql_insert(con,entities):
    # creating cursor object
    cur=con.cursor()
    # cursor.execute()
    cur.execute("insert into employee values(?,?,?,?,?,?)",entities)
    # saving data to database
    con.commit()
    # message
    print("Data Inserted Successfully")

In [16]:
# insert into table.
entities=(2,'Andrew',50000,'HR','Manager','2012-04-05')
sql_insert(db,entities)

Data Inserted Successfully

## Checking data in Table

In [17]:
# checking result
def sql_view(con): # define table_name(connection name)
    cur=con.cursor()
    print(cur.execute("Select * from employee").fetchall())


# call function with the name of database
sql_view(db)

[(1, 'jack', 9000.0, 'HR', 'Manager', '2019-07-09'), (2, 'Andrew', 50000.0, 'HR', 'Manager', '2012-04-05')]

## Update Function

In [18]:
## Update Function

def sql_update(con):
    cursor=con.cursor()
    cursor.execute("Update employee set name='John' where id==1")
    con.commit()
    print("Data Updated Successfully")
    
sql_update(db)

Data Updated Successfully

In [19]:
entities=(3,'Anand',60000,'HR','Manager','2012-04-05')
sql_insert(db,entities)

entities=(4,'Ankit',90000,'IT','SR Manager','2025-06-09')
sql_insert(db,entities)

Data Inserted Successfully
Data Inserted Successfully

In [20]:
entities=(5,'Naveen',40000,'IT','Manager','2021-04-04')
sql_insert(db,entities)

entities=(6,'Navneet',55000,'CS','Manager','2024-04-04')
sql_insert(db,entities)

Data Inserted Successfully
Data Inserted Successfully

In [21]:
sql_view(db)

[(1, 'John', 9000.0, 'HR', 'Manager', '2019-07-09'), (2, 'Andrew', 50000.0, 'HR', 'Manager', '2012-04-05'), (3, 'Anand', 60000.0, 'HR', 'Manager', '2012-04-05'), (4, 'Ankit', 90000.0, 'IT', 'SR Manager', '2025-06-09'), (5, 'Naveen', 40000.0, 'IT', 'Manager', '2021-04-04'), (6, 'Navneet', 55000.0, 'CS', 'Manager', '2024-04-04')]

In [22]:
print(cur.execute("select id,name from employee where department in ('HR')").fetchall())

[(1, 'John'), (2, 'Andrew'), (3, 'Anand')]

In [23]:
print(cur.execute("select name,salary from employee where department in ('IT')").fetchall())

[('Ankit', 90000.0), ('Naveen', 40000.0)]

In [24]:
print(cur.execute("select Dateofjoin, name from employee where salary>50000 ").fetchall())

[('2012-04-05', 'Anand'), ('2025-06-09', 'Ankit'), ('2024-04-04', 'Navneet')]

In [25]:
print(cur.execute("select name,id from employee where salary not in (select salary from employee where salary<50000 )").fetchall())

[('Andrew', 2), ('Anand', 3), ('Ankit', 4), ('Navneet', 6)]

## Delete Function

In [26]:
def sql_delete(db):
    cur=db.cursor()
    cur.execute("delete from employee where id==2 ")
    db.commit()

In [27]:
print("Minimum Salary",cur.execute("select min(salary),name,id from employee").fetchone())
print("Maximum Salary",cur.execute("select max(salary),name,id from employee").fetchone())
print("Average Salary",cur.execute("select avg(salary) from employee").fetchone())

Minimum Salary (9000.0, 'John', 1)
Maximum Salary (90000.0, 'Ankit', 4)
Average Salary (50666.666666666664,)

In [28]:
print("count",cur.execute("select count(name),count(department),count(position),count(Dateofjoin) from EMPLOYEE").fetchall())

count [(6, 6, 6, 6)]

## Distinct Function

In [29]:
# will show the distinct department names

print(cur.execute("select distinct(department) from employee").fetchall())

[('HR',), ('IT',), ('CS',)]

In [30]:
# will show the count of the distinct department

print(cur.execute("select count(distinct(department)) from employee").fetchall())

[(3,)]

In [31]:
# will show distinct position in department

print(cur.execute("select distinct(position) from employee").fetchall())

[('Manager',), ('SR Manager',)]

In [32]:
print(cur.execute("select count(distinct(position)) from employee").fetchall())

[(2,)]

## Group BY Function

In [33]:
cur.execute("select sum(salary),position FROM employee GROUP BY position").fetchall()

[(214000.0, 'Manager'), (90000.0, 'SR Manager')]

In [34]:
cur.execute('select sum(salary),department FROM employee GROUP BY department').fetchall()

[(55000.0, 'CS'), (119000.0, 'HR'), (130000.0, 'IT')]

## Calling Details

In [35]:
# process 1

def sql_query(con,sql):
    cursor=con.cursor()
    result=cursor.execute(sql)
    return result

In [36]:
sql="select * from employee"

response=sql_query(db,sql)
response.fetchall()

[(1, 'John', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 50000.0, 'HR', 'Manager', '2012-04-05'),
 (3, 'Anand', 60000.0, 'HR', 'Manager', '2012-04-05'),
 (4, 'Ankit', 90000.0, 'IT', 'SR Manager', '2025-06-09'),
 (5, 'Naveen', 40000.0, 'IT', 'Manager', '2021-04-04'),
 (6, 'Navneet', 55000.0, 'CS', 'Manager', '2024-04-04')]

In [37]:
# process 2

def sql_query(con,sql):
    cursor=con.cursor()
    return cursor.execute(sql).fetchall()

sql_query(db,sql)

[(1, 'John', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 50000.0, 'HR', 'Manager', '2012-04-05'),
 (3, 'Anand', 60000.0, 'HR', 'Manager', '2012-04-05'),
 (4, 'Ankit', 90000.0, 'IT', 'SR Manager', '2025-06-09'),
 (5, 'Naveen', 40000.0, 'IT', 'Manager', '2021-04-04'),
 (6, 'Navneet', 55000.0, 'CS', 'Manager', '2024-04-04')]

In [38]:
sql="select max(salary),name from employee"
sql_query(db,sql)

[(90000.0, 'Ankit')]

# Execute Many Method

In [39]:
entities=[(9,'Nitin',50000,'CS','Manager','2021-04-04'),(10,'Anoop',60000,'Sales','Manager_Sales','2022-04-23')]

In [40]:
# executemany will allow us to insert maximum values at one time.

cur.executemany("insert into employee values (?,?,?,?,?,?)",entities)

In [41]:
# calling function to check the query

sql_query(db,sql="select * from employee")

[(1, 'John', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 50000.0, 'HR', 'Manager', '2012-04-05'),
 (3, 'Anand', 60000.0, 'HR', 'Manager', '2012-04-05'),
 (4, 'Ankit', 90000.0, 'IT', 'SR Manager', '2025-06-09'),
 (5, 'Naveen', 40000.0, 'IT', 'Manager', '2021-04-04'),
 (6, 'Navneet', 55000.0, 'CS', 'Manager', '2024-04-04'),
 (9, 'Nitin', 50000.0, 'CS', 'Manager', '2021-04-04'),
 (10, 'Anoop', 60000.0, 'Sales', 'Manager_Sales', '2022-04-23')]

In [42]:
print(sql_query(db,"select name,id from employee order by name asc"))
print(sql_query(db,"select count(distinct(department)) from employee"))
print(sql_query(db,"select distinct(department) from employee"))
print(sql_query(db,"select count(distinct(position)) from employee"))
print(sql_query(db,"select distinct(position) from employee"))

[('Anand', 3), ('Andrew', 2), ('Ankit', 4), ('Anoop', 10), ('John', 1), ('Naveen', 5), ('Navneet', 6), ('Nitin', 9)]
[(4,)]
[('HR',), ('IT',), ('CS',), ('Sales',)]
[(3,)]
[('Manager',), ('SR Manager',), ('Manager_Sales',)]

In [43]:
sql="drop table employee"
cur.execute(sql)
db.commit()
db.close()

print("Deleted Table and closed the Data base")

Deleted Table and closed the Data base

__________________

# ..............................................Referential Integrity..............................................

Referential integrity is used to maintain the data consistency between two tables. Rules are made in the database structure about how foreign keys should be used to ensure that changes, addition and deletion in the database maintain the data integrity. The referential integrity constraints state that if a foreign key in the first table refers to the primary key of the second table then every value of foreign key in the first table should either be null or present in the second table.

In [1]:
# import sql library
import sqlite3

# create connection or reference object for database
db=sqlite3.connect("School_Database.db")


# create cursor object
cur=db.cursor()

# message
print("Database created Successfully")

Database created Successfully

In [2]:
# create table course under database school database
cur.execute("create table Course(CourseID int primary key, CourseName text,Duration int)")

In [3]:
# create table Student under data base School Database and courseid as foreign key reference Course(courseID) 
cur.execute("create table Student(id int primary key, name text, age varchar(2),CourseID int, FOREIGN KEY(CourseID) references Course(CourseID))")

### Insert data into Course Table

In [4]:
sql="insert into Course values (78,'Data Science',12),(56,'Python',4),(101,'Database',7)"

# execute the query
cur.execute(sql)

# save the data
db.commit()

# print message
print(cur.rowcount,"Rows Inserted")

3 Rows Inserted

### Insert data into Student Table

In [5]:
sql="insert into Student values(1,'Pankaj',22,78)"
cur.execute(sql)
db.commit()

In [6]:
sql="insert into student values(2,'Neeraj',23,56)"
cur.execute(sql)
db.commit()

In [7]:
sql="insert into student values(3,'Puneet',45,101)"
cur.execute(sql)

In [8]:
sql="insert into student values(4,'Pankit',27,78)"
cur.execute(sql)
db.commit()

In [9]:
sql="insert into student values(5,'pranab',19,67)"

In [10]:
cur.execute(sql)
db.commit()

In [11]:
sql="select * from student"
cur.execute(sql).fetchall()

[(1, 'Pankaj', '22', 78),
 (2, 'Neeraj', '23', 56),
 (3, 'Puneet', '45', 101),
 (4, 'Pankit', '27', 78),
 (5, 'pranab', '19', 67)]

## Subquery or Nested Query

In [12]:
sql="select name from student where courseID=(select CourseID from Course where courseName='Data Science' )"

cur.execute(sql).fetchall()

[('Pankaj',), ('Pankit',)]

In [13]:
cur.execute("Select name from student where courseId=(select CourseID from Course where courseName='Python')").fetchall()

[('Neeraj',)]

In [14]:
cur.execute("Select name from student where courseId=(select CourseID from Course where courseName='Database')").fetchall()

[('Puneet',)]

In [15]:
cur.execute("select CourseID from Course where courseName='Database'").fetchone()

(101,)

# Join

1. Inner-Join : (all common from both table)
2. Left-Join  : (Show all records from left table)
3. Right-Join : (show the data from right side of table)
4. Outer-Join : (Will Show all data from both tables)

### InnerJoin

In [18]:
# student_table inner join course_table
sql="select student.id, student.name, course.courseID, course.courseName from student INNER JOIN Course ON student.CourseID=course.CourseID"

cur.execute(sql).fetchall()

[(1, 'Pankaj', 78, 'Data Science'),
 (2, 'Neeraj', 56, 'Python'),
 (3, 'Puneet', 101, 'Database'),
 (4, 'Pankit', 78, 'Data Science')]

In [22]:
sql="select student.id, student.name, course.courseName, course.CourseID from COURSE INNER JOIN student on course.CourseID=student.CourseID "
cur.execute(sql).fetchall()

[(1, 'Pankaj', 'Data Science', 78),
 (2, 'Neeraj', 'Python', 56),
 (3, 'Puneet', 'Database', 101),
 (4, 'Pankit', 'Data Science', 78)]

### Left Join

In [23]:
sql="select student.id, student.name, course.courseName, course.CourseID from COURSE LEFT JOIN student on course.CourseID=student.CourseID "
cur.execute(sql).fetchall()

[(1, 'Pankaj', 'Data Science', 78),
 (4, 'Pankit', 'Data Science', 78),
 (2, 'Neeraj', 'Python', 56),
 (3, 'Puneet', 'Database', 101)]

## Right Join and Outer join in not available in sqlite3

****************

In [4]:
# import sqlite3 library
import sqlite3